Tekla Open API Reference for Tekla Structures 2025
ControlCircle.Point2 Property
 Gets or sets the second point. Point2 contains the original input Point1 after selecting the control circle.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point Point2 { get; set; }
Public Property Point2 As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
ControlCircle Class
Tekla.Structures.Model Namespace